-------------------------------------------------------------------------------
-- @date 2015/10/14
-- @author chorai
-------------------------------------------------------------------------------
GameConst = {}
-----------------------------------------------------------------------------
-- カードの属性　1:水　2:火　3:木　4:光　5:闇　
-----------------------------------------------------------------------------
GameConst.ATTRIBUTE = {
	WATER 	= 1,
	FIRE 	= 2,
	TREE 	= 3,
	LIGHT 	= 4,
	DARK 	= 5,
}

GameConst.DEBUFF = {
	ATK = 1,
	FREEZE = 2,
	DEFDOWN = 3,
}

GameConst.PUZZLEOBJTAG = {
	T_Bullet = 1,
	T_Bullet1 = 2,
	T_Bullet2 = 3,
	T_Bullet3 = 4,
	T_Bullet4 = 5,
	T_Bullet5 = 6,
	T_Dialog = 7,
	T_Line = 8,
}
